#По двум заданным числам проверять является ли одно квадратом другого
# a = 4
# b = 18
# if b==a*a:
#     print ('{0} - является квадрато числа {1}'.format(b, a))
# else:
#     print('{0} - не является квадрато числа {1}'.format(b, a))

# 18 Проверить истинность утверждения ¬(X ⋁ Y) = ¬X ⋀ ¬Y
# x = int (5)
# y = int (4)
# res1 = not(x or y)
# res2 = not x and not y
# # print(res1)
# # print(res2)
# if res1 == res2:
#     print('true')
# else:
#     print('false')

# 19 Определить номер четверти плоскости, в которой находится точка с координатами Х и У, причем X ≠ 0 и Y ≠ 0
# x = int (input('Введите X '))
# y = int (input('Введите Y '))
# if x>0 and y>=0:
#     print('координата находится в 1й четверти')
# if x<-0 and y>0:
#     print('координата находится в 2й четверти')
# if x<-0 and y<-0:
#     print('координата находится в 3й четверти')
# if x>=0 and y<-0:
#     print('координата находится в 4й четверти')
# if x==0 and y==0 or x==-0 and y==-0:
#     print ('координата находится в точке пересечения осей X и Y')

# 20 Задать номер четверти, показать диапазоны для возможных координат
# n = int (input('введите номер четверти координатной плоскости '))
# if n == 1:
#     print ('диапазон координт от X>0 и Y>0')
# if n==2:
#     print('диапазон координт от X<0 и Y>0')
# if n==3:
#     print('диапазон координт от X<0 и Y<0')
# if n==4:
#     print('диапазон координт от X>0 и Y<0')

# 21 Программа проверяет пятизначное число на палиндромом.
# 22 Найти расстояние между точками в пространстве 2D/3D
# 23 Показать таблицу квадратов чисел от 1 до N
# 24 Найти кубы чисел от 1 до N
# 25 Найти сумму чисел от 1 до А
# 26 Возведите число А в натуральную степень B используя цикл
# 27 Определить количество цифр в числе
# 28 Подсчитать сумму цифр в числе
# 29 Написать программу вычисления произведения чисел от 1 до N
# 30 Показать кубы чисел, заканчивающихся на четную цифру